In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }

In [3]:
dict1

{'Name': ['Priyang',
  'Aadhya',
  'Krisha',
  'Vedant',
  'Parshv',
  'Mittal',
  'Archana'],
 'Marks': [98, nan, 99, 87, nan, 83, 99],
 'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female'],
 'Email': ['priyang@gmail.com',
  'aadhya@gmail.com',
  'krisha@gmail.com',
  'vedant@yahoo.com',
  'parshv@hotmail.com',
  'mittal@yahoo.com',
  'archana@yahoo.com']}

In [6]:
df1=pd.DataFrame(dict1)

In [7]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [8]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [9]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [11]:
df1.head(-3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com

In [12]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [13]:
df1.shape

(7, 4)

In [14]:
print("NUmber of row",df1.shape[0])
print("NUmber of columns",df1.shape[1])

NUmber of row 7
NUmber of columns 4

In [15]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [16]:
df1['Marks'].shape

(7,)

In [17]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [22]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [24]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [25]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [26]:
df1['Marks'].unique()

array([98., nan, 99., 87., 83.])

In [30]:
df1['Gender'].nunique()

2

In [31]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [33]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [39]:
df1.dropna(how='any')

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [40]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [41]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [42]:
df1.fillna(0)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [45]:
df1['Marks']=df1['Marks'].fillna(df1['Marks'].mean())

In [46]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [50]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [52]:
df1['Marks'].between(80,90).sum()

2

In [60]:
df1[df1['Marks'].min()==df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [66]:
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [70]:
df1.sort_values(by='Marks',ascending=False).head(5)[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [75]:
df1['Marks'].mean()

93.2

In [76]:
def marks(x):
    return(x/2)

In [78]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [79]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [80]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [82]:
df1['Male_Female']=df1['Gender'].map({"Male":1,"Female":0})

In [87]:
df1.drop('Male_Female',axis=1,inplace=True)

In [88]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [92]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email  Half_Marks
2   Krisha   99.0  Female    krisha@gmail.com        49.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
5   Mittal   83.0  Female    mittal@yahoo.com        41.5

In [96]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [101]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [102]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [103]:
df1['Marks']

0    98.0
1    93.2
2    99.0
3    87.0
4    93.2
5    83.0
6    99.0
Name: Marks, dtype: float64

In [105]:
df1.rename(columns={'Marks':'Final_marks'})

      Name  Final_marks  Gender               Email  Half_Marks
0  Priyang         98.0    Male   priyang@gmail.com        49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5

In [106]:
df2=pd.DataFrame({'Name':'Anil','Marks':90,'Gender':'Male','Email':"anil@gmail.com"},index=[0])

In [107]:
df3=pd.concat([df1,df2],ignore_index=True)

In [108]:
df3

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
7     Anil   90.0    Male      anil@gmail.com         NaN

In [109]:
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1   93.2  Female
2   99.0  Female
3   87.0    Male
4   93.2    Male
5   83.0  Female
6   99.0  Female

In [113]:
df1.iloc[:,1:3]

   Marks  Gender
0   98.0    Male
1   93.2  Female
2   99.0  Female
3   87.0    Male
4   93.2    Male
5   83.0  Female
6   99.0  Female

In [120]:
df1['Name_marks']=df1['Name']+' : '+df1['Marks'].apply(str)

In [121]:
df1['Name_marks']

0    Priyang : 98.0
1     Aadhya : 93.2
2     Krisha : 99.0
3     Vedant : 87.0
4     Parshv : 93.2
5     Mittal : 83.0
6    Archana : 99.0
Name: Name_marks, dtype: object

In [122]:
df1

      Name  Marks  Gender               Email  Half_Marks      Name_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0  Priyang : 98.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6   Aadhya : 93.2
2   Krisha   99.0  Female    krisha@gmail.com        49.5   Krisha : 99.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5   Vedant : 87.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.6   Parshv : 93.2
5   Mittal   83.0  Female    mittal@yahoo.com        41.5   Mittal : 83.0
6  Archana   99.0  Female   archana@yahoo.com        49.5  Archana : 99.0

In [130]:
type(df1.groupby('Gender')['Marks'].mean().sort_values(ascending=True).to_frame())

pandas.core.frame.DataFrame

In [146]:
df1['Email'][0].split('@')[1]

'gmail.com'

In [147]:
list1=[]
for email in df1['Email']:
    list1.append(email.split('@')[1])

In [151]:
df1['temp']=list1

In [154]:
df1['temp'].value_counts()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: temp, dtype: int64

In [159]:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: Email, dtype: int64

In [ ]:
.apply()